#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aws-cost-slack.aws_cloudwatch_event_rule.every_five_minutes will be created
  + resource "aws_cloudwatch_event_rule" "every_five_minutes" {
      + arn                 = (known after apply)
      + description         = "Fires every five minutes"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-five-minutes"
      + schedule_expression = "rate(5 minutes)"
    }

  # module.aws-cost-slack.aws_cloudwatch_event_target.check_foo_every_five_minutes will be created
  + resource "aws_cloudwatch_event_target" "check_foo_every_five_minutes" {
      + arn       = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack/invocations"
      + id        = (known after apply)
      + rule      = "every-five-minutes"
      + target_id = "aws-cost-slack"
    }

  # module.aws-cost-slack.aws_lambda_permission.allow_cloudwatch_to_call_check_foo will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_foo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-cost-slack"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.aws-cost-slack.module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack"
        description                    = "Deployment deploy status task"
        filename                       = ".terraform/modules/aws-cost-slack.lambda/builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip"
        function_name                  = "aws-cost-slack"
        handler                        = "handler.report_cost"
        id                             = "aws-cost-slack"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack/invocations"
        last_modified                  = "2020-02-11T09:56:28.974+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-cost-slack"
        runtime                        = "python3.6"
        source_code_hash               = "msTpJkeOQdp0iKyQCHK4pN9PadsAJTCBtXKHQ3uawNQ="
        source_code_size               = 1731
        tags                           = {}
        timeout                        = 300
        version                        = "$LATEST"

      + environment {
          + variables = {
              + "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
